# Module 2: Data Engineering
## Sprint 2: SQL and Data Scraping
## Subproject 2: More hands on SQL

In the last lesson you got familiar with SQL. You created tables and wrote basic queries. During the lesson we will take a closer look into technical part of SQL. You will learn how to create and host your own database. You will know how to use Python to connect to database and send SQL queries to retrieve information. We will also talk about strong and weak points of SQL databases.

## Learning outcomes
- You will know how to use PostgreSQL databases
- You will be able to set up external databases hosted by Heroku
- You will be able to query SQL databases using Python

---

## Relational databases in depth
In the last lesson you went through a crash course of SQL. In this lesson you have an opportunity to take a deeper look into this subject by watching [Advanced SQL course | SQL tutorial advanced](https://www.youtube.com/watch?v=2Fn0WAyZV0E&ab_channel=Geek%27sLesson) video. You will not be required to prove your newly gained knowledge in the exercises but the knowledge will open more opportunities for you as a data engineer. As it is quite impossible to become databases expert in only two days, you will have to learn about certain parts of this topic yourself. It can be a side project or an internship in a company that provide you an opportunities to fully showcase your SQL skills as the main strong points of relational databases are only revealed at scale. Below is a list of topics that you should learn and provided learning material sources:
* [Functions](https://www.studytonight.com/dbms/sql-function.php)
* [Stored Procedures](https://www.w3schools.com/sql/sql_stored_procedures.asp)
* [Hierarchical Queries](https://docs.oracle.com/cd/B19306_01/server.102/b14200/queries003.htm)
* [Dynamic SQL](https://docs.oracle.com/cd/A87860_01/doc/appdev.817/a76939/adg09dyn.htm)
* [Data Modelling](https://afteracademy.com/blog/what-is-data-model-in-dbms-and-what-are-its-types): Normal Forms, 1 through 3
* [Isolation Levels](https://www.geeksforgeeks.org/transaction-isolation-levels-dbms/) and [Transactions](https://www.geeksforgeeks.org/sql-transactions/)

You should visit each topic individually as you fill find tons of information that cannot be summarized into one day lesson. All of the provided topics are important and should not be ignored but as mentioned before they are advanced SQL level topics so you should not feel overwhelmed by not being able to fully understand them as the actual usage of provided resources in practice can only be applied at scale.

## PostgreSQL
The main topic of this lesson is the creation of an actual working database. You will be working with PostgreSQL relational database. So why Postgre? In the relational database world there are many big players that you can choose from: MySQL, PostgreSQL, OracleSQL and many more. For individual use, usually differences are really minor but for companies there are many things to consider before choosing one. To better understand this topic, you need to watch [this video](https://www.youtube.com/watch?v=WzfDLqt-WIg&ab_channel=Socratica) that in TLDR format explains differences between the databases. In comparison with MySQL or MariaDB, Postgres has these strong points:

* Better Data Integrity
* Better Licensing
* JSON Support and NoSQL
* Sub queries work better

Of course, Postgres has its own weaknesses too. So you will need to choose database case by case but for this lesson, you will work with it.

### Hosting PostgreSQL database
As you need a machine with pre-installed database software, you will need to use free tool that enables you to create and initialize your own database. You will need to register at [https://id.heroku.com/login](https://id.heroku.com/login). After, you should go and create new app: 
<div>
<img src="https://i.imgur.com/qjUGLcQ.png" width="400px"/>  
</div>
Select Europe as the region and then give an unique name to your project:  
<div>
<img src="https://i.imgur.com/IKtNVXL.png" width="400px"/>  
</div>
After creation of the project you should go to `Resources` tab and  add `Heroku Postgres` add-on to your project.  
<div>
<img src="https://i.imgur.com/SoozILw.png" width="400px"/> 
</div>
<div>
<img src="https://i.imgur.com/Ssuzyfn.png" width="400px"/>  
</div>
<div>
<img src="https://i.imgur.com/oUpOvPD.png" width="400px"/> 
 </div>
 <div>
<img src="https://i.imgur.com/yKo8emB.png" width="400px"/>  
</div>
After add-on initialization, go to its page and select `Setting` tab where you will see database's credentials:
<div>
<img src="https://i.imgur.com/rB45aho.png" width="600px"/>  
</div>

### Using Python with PostgreSQL
Now we are able to use hosted database using Python. First we need to install `psycopg2` to our environment:

In [ ]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in /usr/local/lib/python3.7/dist-packages (2.7.6.1)

To connect to the database we have to simply use `psycopg2` connect function and the use the initiated connection to work with the remote database. You will have to provide credentials provided by Heroku Postgres:

In [ ]:
import psycopg2

connection = psycopg2.connect(
    database="d6n25n96oqcau5",
    user="kywujunfykyruz",
    password="14feadbcd30a61adb3d688118837e4d46d6dca91d52e0c2f520b720205f92906",
    host="ec2-54-78-36-245.eu-west-1.compute.amazonaws.com",
    port="5432"
)

connection

Now that we have the connection let's create same `users` and `cards` tables from the last lesson. We will need to create `cursor` from the connection and then execute `SQL` commands:

In [ ]:
cur = connection.cursor()

cur.execute('''
CREATE TABLE users (
    id serial PRIMARY KEY,
    fullName varchar(255),
    cardId int
);
''')


cur.execute('''
CREATE TABLE cards (
    id serial PRIMARY KEY,
    userId int,
    lastUsedDate date
);
''')

cur.execute('''
ALTER TABLE users ADD FOREIGN KEY (cardId) REFERENCES cards(id);
ALTER TABLE cards ADD FOREIGN KEY (userId) REFERENCES users(id);
INSERT INTO users(fullName) VALUES('Peter Parker');
INSERT INTO cards(userid, lastuseddate) VALUES(1, '2020-01-01');
UPDATE users SET cardId = 1 WHERE id = 1;
''')

connection.commit()

You can check the data inside tables by using `execute` and `fetchall` functions:

In [ ]:
cur.execute("SELECT * FROM users")
rows = cur.fetchall()

for row in rows:
    print(f"id: {row[0]}, fullName: {row[1]}, cardId: {row[2]}")

id: 1, fullName: Peter Parker, cardId: 1

### Exercise
Now that you know how to use `psycopg2` you should create same two tables `books` and `authors` from last lesson. You will need to insert same data and make same queries.

In [ ]:
cur = connection.cursor()
cur.execute('''
CREATE TABLE authors(
    id serial PRIMARY KEY,
    fullname varchar(100)
    );
''')

cur.execute('''
CREATE TABLE books (
    id serial PRIMARY KEY,
    title varchar(50),
    authorid int,
    releasedate DATE
);
''')

cur.execute('''
ALTER TABLE books ADD FOREIGN KEY (authorid) REFERENCES authors(id);
''')

cur.execute('''
INSERT INTO authors(id,fullname) VALUES(1,'J. K. Rowling');
INSERT INTO authors(id,fullname) VALUES(2,'Mary Shelley');
INSERT INTO authors(id,fullname) VALUES(3,'Suzanne Collins');
''')

cur.execute('''
INSERT INTO books(id,title,authorid,releasedate) VALUES(1,'Philosphers Stone',1,'1997-01-01');
INSERT INTO books(id,title,authorid,releasedate) VALUES(2,'Chamber of Secrets',1,'1998-01-01');
INSERT INTO books(id,title,authorid,releasedate) VALUES(3,'Prisoner of Azkaban',1,'1999-01-01');
INSERT INTO books(id,title,authorid,releasedate) VALUES(4,'Globet of fire',1,'2000-01-01');
INSERT INTO books(id,title,authorid,releasedate) VALUES(5,'Order of the Phoenix',1,'2003-01-01');
INSERT INTO books(id,title,authorid,releasedate) VALUES(6,'Frankenstein',2,'1823-01-01');
INSERT INTO books(id,title,authorid,releasedate) VALUES(7,'The Hunger Games',3,'2008-01-01');
INSERT INTO books(id,title,authorid,releasedate) VALUES(8,'Catching Fire',3,'2009-01-01');
''')
connection.commit()

Write Python code in a the cell above for tests below to pass.

In [ ]:
### GET LIST OF ALL AUTHORS
cur.execute("SELECT * FROM authors;")
authors = cur.fetchall()

assert len(authors) == 3
assert authors[0][1] == "J. K. Rowling"

### GET LIST OF ALL BOOKS
cur.execute("SELECT * FROM books;")
books = cur.fetchall()

assert len(books) == 8
assert books[1][1] == "Chamber of Secrets"

### GET LIST OF BOOKS WITH AUTHORS ATTACHED
cur.execute("SELECT books.id, books.title, authors.fullname FROM books LEFT JOIN authors ON books.authorid = authors.id;")
books = cur.fetchall()

assert len(books) == 8
assert books[1][1] == "Chamber of Secrets"
assert books[1][2] == "J. K. Rowling"

### GET COUNT OF BOOKS WRITTEN BY AUTHOR
cur.execute("SELECT authors.fullname as author, COUNT(authors.fullname) as books_count FROM books LEFT JOIN authors ON books.authorid = authors.id GROUP BY authors.fullname;")
books_count = cur.fetchall()

assert len(books_count) == 3
assert books_count[1][0] == "J. K. Rowling"
assert books_count[1][1] == 5

## SQL - when it does not work?
For the last two days you were learning about relational databases and SQL. You should know that SQL works really well when you have structured data and need to perform multiple data collection manipulations. Parts where SQL lacks are search and optimized document storage. For these specific cases Not Only SQL is used. There are many different types of NoSQL databases. If every SQL database (MySQL, Oracle SQL, PostgreSQL) are familiar, NoSQL world is more diverse and every database has its own specific use cases. Let's talk about most popular ones and where and why they are used. But before that you should watch [more general overview](https://www.youtube.com/watch?v=ruz-vK8IesE&ab_channel=BeABetterDev) of the NoSQL world.

## MongoDB
MongoDB is the most used SQL alternative. As Mongo is the most universal and flexible NoSQL database. The biggest advantage of it is scalability. As the data is stored in documents and not in the individual tables, there is no need for joins, which can get quite expensive when working with huge tables full of records. Search is also more optimized in MongoDB. You should take a look into [official documentation](https://www.mongodb.com/nosql-explained) and watch [this](https://www.youtube.com/watch?v=EE8ZTQxa0AM&ab_channel=MongoDB) 5 min. video that covers all basic aspects of the database. You can also watch a [comparison](https://www.youtube.com/watch?v=ZS_kXvOeQ5Y&ab_channel=Academind) made between SQL and NoSQl when talking about MySQL vs MongoDB case.

## Cassandra
Cassandra is mostly used when working with time series data and key-value storage. Because of unique database structure Cassandra can perform queries instantly and return huge numbers of data in a matter of moment. You should read about Cassandra in [this TLDR](https://www.credera.com/insights/cassandra-explained-5-minutes-less/). You should also watch [this](https://www.youtube.com/watch?v=iDhIjrJ7hG0&ab_channel=edureka%21) video that explains Cassandra more in-depth.

## Redis
Redis is mostly used when talking about caching and quick data retrieval. Redis is also widely used in applications where some kind of live counting is needed (for example leaderboards). You should read [blog post](https://www.ibm.com/cloud/learn/redis) created by IBM and learn about most popular use cases and specific data types. [Here](https://www.youtube.com/watch?v=Hbt56gFj998&ab_channel=TraversyMedia) is also amazing video that covers most popular Redis use cases and provides practical approach to them.

## Exercise
For this lesson you will have to transfer Tesla factory to hosted PostrgeSQL database. You will need to use Python `psycopg2` client for this task. As in the last lesson you had to provide screeshots with outputs, now you will need to provide python code. You have to create these tables:
```
| Models            |
|-------------------|
| Id serial         |
| ModelName varchar |
| Range int         |

| Cars              |
|-------------------|
| Id serial         |
| ModelId int       |
| PlateNo varchar   |

| Owners         |
|----------------|
| Id serial      |
| FullName       |
| PersonalId int |

| OwnerCars   |
|-------------|
| CarId int   |
| OwnerId int |

```

You will need to add 3 records to `Models` table, 10 records to `Owners` table and `15` records to `Cars table`. All cars should be assigned to an owner. One owner can have more than 1 car.

1. Create new application on Heroku and add Postgres ad-on to it
2. Initialize connection to the database and create required tables using `psycopg2`
3. Write code to successfully run these queries:
* List all `Models`
* List all `Cars`
* List all `Users`
* Return count of grouped cars by model
* Return count of grouped cars by owner
* Return owner that owns most cars
* Return average number of cars owners own
* Return list of cars with owners `FullName` attached
4. Put all your code to the python file. Do not forget to document your code.

In [ ]:
conn = psycopg2.connect(
    database="d954vjcs3noaot",
    user="gmhnwgkmbjfygj",
    password="d7c5293f8a6041f536297492e7a92ba77ebfc0d053852c19d67289904fd7d449",
    host="ec2-34-254-69-72.eu-west-1.compute.amazonaws.com",
    port="5432"
)

conn

In [ ]:
cur = conn.cursor()
cur.execute('''
CREATE TABLE models(
    id serial PRIMARY KEY,
    modelname varchar(100),
    range int
    );
''')

cur.execute('''
CREATE TABLE cars (
    id serial PRIMARY KEY,
    modelid int,
    plateno varchar(5)
);
''')
cur.execute('''
CREATE TABLE owners (
    id serial PRIMARY KEY,
    fullname varchar(100),
    personalid int
);
''')
cur.execute('''
CREATE TABLE ownercars (
    carid int,
    ownerid int
);
''')

cur.execute('''
ALTER TABLE cars ADD FOREIGN KEY (modelid) REFERENCES models(id);
ALTER TABLE ownercars ADD FOREIGN KEY (carid) REFERENCES cars(id);
ALTER TABLE ownercars ADD FOREIGN KEY (ownerid) REFERENCES owners(id);
''')

cur.execute('''
INSERT INTO models(id,modelname,range) VALUES(1,'Model S',70620);
INSERT INTO models(id,modelname,range) VALUES(2,'Model X',52190);
INSERT INTO models(id,modelname,range) VALUES(3,'Model Y',81190);
''')

cur.execute('''
INSERT INTO cars(id,modelid,plateno) VALUES(1,1,'PLX');
INSERT INTO cars(id,modelid,plateno) VALUES(2,1,'ZSY');
INSERT INTO cars(id,modelid,plateno) VALUES(3,1,'YYQ');
INSERT INTO cars(id,modelid,plateno) VALUES(4,1,'WQF');
INSERT INTO cars(id,modelid,plateno) VALUES(5,1,'WWQ');
INSERT INTO cars(id,modelid,plateno) VALUES(6,2,'ZZQ');
INSERT INTO cars(id,modelid,plateno) VALUES(7,2,'YYQ');
INSERT INTO cars(id,modelid,plateno) VALUES(8,2,'YZS');
INSERT INTO cars(id,modelid,plateno) VALUES(9,2,'QQP');
INSERT INTO cars(id,modelid,plateno) VALUES(10,2,'AAS');
INSERT INTO cars(id,modelid,plateno) VALUES(11,3,'YWE');
INSERT INTO cars(id,modelid,plateno) VALUES(12,3,'QWE');
INSERT INTO cars(id,modelid,plateno) VALUES(13,3,'UUI');
INSERT INTO cars(id,modelid,plateno) VALUES(14,3,'ITU');
INSERT INTO cars(id,modelid,plateno) VALUES(15,3,'ITK');
''')
cur.execute('''
INSERT INTO owners(id,fullname,personalid) VALUES(1,'Linus Mbah',11);
INSERT INTO owners(id,fullname,personalid) VALUES(2,'Bezos Via',12);
INSERT INTO owners(id,fullname,personalid) VALUES(3,'Lii Vio',13);
INSERT INTO owners(id,fullname,personalid) VALUES(4,'Kion Onu',14);
INSERT INTO owners(id,fullname,personalid) VALUES(5,'Kia Wiz',15);
INSERT INTO owners(id,fullname,personalid) VALUES(6,'Jiu Mbu',16);
INSERT INTO owners(id,fullname,personalid) VALUES(7,'Sien Jion',17);
INSERT INTO owners(id,fullname,personalid) VALUES(8,'Paulo Wiz',18);
INSERT INTO owners(id,fullname,personalid) VALUES(9,'Mbuzo Milk',19);
INSERT INTO owners(id,fullname,personalid) VALUES(10,'Jane Smith',20);
''')

cur.execute('''
INSERT INTO ownercars(carid,ownerid) VALUES(1,1);
INSERT INTO ownercars(carid,ownerid) VALUES(2,1);
INSERT INTO ownercars(carid,ownerid) VALUES(3,1);
INSERT INTO ownercars(carid,ownerid) VALUES(4,2);
INSERT INTO ownercars(carid,ownerid) VALUES(5,2);
INSERT INTO ownercars(carid,ownerid) VALUES(6,3);
INSERT INTO ownercars(carid,ownerid) VALUES(7,3);
INSERT INTO ownercars(carid,ownerid) VALUES(8,4);
INSERT INTO ownercars(carid,ownerid) VALUES(9,5);
INSERT INTO ownercars(carid,ownerid) VALUES(10,6);
INSERT INTO ownercars(carid,ownerid) VALUES(11,7);
INSERT INTO ownercars(carid,ownerid) VALUES(12,8);
INSERT INTO ownercars(carid,ownerid) VALUES(13,9);
INSERT INTO ownercars(carid,ownerid) VALUES(14,10);
INSERT INTO ownercars(carid,ownerid) VALUES(15,10);
''')

connection.commit()

In [ ]:
cur.execute("SELECT * FROM models;")
models = cur.fetchall()

In [ ]:
models

[(1, 'Model S', 70620), (2, 'Model X', 52190), (3, 'Model Y', 81190)]

In [ ]:
assert len(models) == 3

In [ ]:
cur.execute("SELECT * FROM cars;")
cars = cur.fetchall()

In [ ]:
for i in cars:
   print(f"id: {i[0]}, Modelid: {i[1]}, plateno: {i[2]}")

id: 1, Modelid: 1, plateno: PLX
id: 2, Modelid: 1, plateno: ZSY
id: 3, Modelid: 1, plateno: YYQ
id: 4, Modelid: 1, plateno: WQF
id: 5, Modelid: 1, plateno: WWQ
id: 6, Modelid: 2, plateno: ZZQ
id: 7, Modelid: 2, plateno: YYQ
id: 8, Modelid: 2, plateno: YZS
id: 9, Modelid: 2, plateno: QQP
id: 10, Modelid: 2, plateno: AAS
id: 11, Modelid: 3, plateno: YWE
id: 12, Modelid: 3, plateno: QWE
id: 13, Modelid: 3, plateno: UUI
id: 14, Modelid: 3, plateno: ITU
id: 15, Modelid: 3, plateno: ITK

In [ ]:
cur.execute("SELECT * FROM owners;")
owners = cur.fetchall()

In [ ]:
for i in owners:
   print(f"id: {i[0]}, fullname: {i[1]}, personalid: {i[2]}")

id: 1, fullname: Linus Mbah, personalid: 11
id: 2, fullname: Bezos Via, personalid: 12
id: 3, fullname: Lii Vio, personalid: 13
id: 4, fullname: Kion Onu, personalid: 14
id: 5, fullname: Kia Wiz, personalid: 15
id: 6, fullname: Jiu Mbu, personalid: 16
id: 7, fullname: Sien Jion, personalid: 17
id: 8, fullname: Paulo Wiz, personalid: 18
id: 9, fullname: Mbuzo Milk, personalid: 19
id: 10, fullname: Jane Smith, personalid: 20

---

In [ ]:
cur.execute("SELECT count(*) FROM cars GROUP BY modelid")
group1 = cur.fetchall()

In [ ]:
group1

[(5,), (5,), (5,)]

In [ ]:
cur.execute("SELECT count(*) FROM ownercars GROUP BY ownerid")
group2 = cur.fetchall()

In [ ]:
group2

[(1,), (2,), (1,), (1,), (2,), (1,), (2,), (1,), (3,), (1,)]

In [ ]:
cur.execute("SELECT count(*) FROM owners JOIN ownercars ON owners.id = ownercars.ownerid GROUP BY ownerid")
group3 = cur.fetchall()

In [ ]:
group3

[(1,), (2,), (1,), (1,), (2,), (1,), (2,), (1,), (3,), (1,)]

In [ ]:
cur.execute("SELECT count(ownerid),ownercars.ownerid,owners.fullname FROM owners JOIN ownercars ON owners.id = ownercars.ownerid GROUP BY ownercars.ownerid,owners.fullname")
group4 = cur.fetchall()

In [ ]:
group4

[(1, 5, 'Kia Wiz'),
 (2, 10, 'Jane Smith'),
 (3, 1, 'Linus Mbah'),
 (1, 6, 'Jiu Mbu'),
 (1, 7, 'Sien Jion'),
 (2, 3, 'Lii Vio'),
 (1, 8, 'Paulo Wiz'),
 (1, 9, 'Mbuzo Milk'),
 (1, 4, 'Kion Onu'),
 (2, 2, 'Bezos Via')]

In [ ]:
for j in group4:
  v=j.count(j[0])
  print(v)

1
1
1
1
1
1
1
1
1
2

## Summary
Now you know how to create your own database using Heroku and PostgreSQL. From this point, you will be able to store your data in external resources. This skill will let you create more functional and powerful applications. Most importantly, now you should understand how relational databases work in practice. For a future data scientist these skills are really valuable.

---